Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: Whereas the traditional topic types associated with DITA XML are concept, task, and reference, Information Mapping's core six information types are principle, process, procedure, concept, fact, and structure.
zh_cn: 与 DITA XML 相关的传统话题类型是概念（concept）、任务（task）和引用（reference），而信息映射的六种核心信息类型是原则（principle）、过程（process）、步骤（procedure）、概念（concept）、事实（fact）和结构（structure）。

source: Which leads us to an important distinction in DITA (or LwDITA)-based workflows.
zh_cn: 这就引出了基于DITA(或LwDITA)的工作流中的一个重要区别。

source: While a professional in another field may be able to use an application with little training, the metaphors and ways of thinking about computing must be explicitly taught.
zh_cn: 虽然其他领域的专业人员可能不用训练就可以使用某个应用程序，但必须将明确地教授他们计算机的隐喻和思考方式。

source: While acknowledging DITA's effectiveness as a replacement for large user manuals in complex industries, a few authors lament that “this form of structured content can feel cold and clinical, especially to those from the editorial or marketing side of content” (Wachter-Boettcher, 2012, p.
zh_cn: 一些创作者，特别是内容编辑和营销方面的创作者，他们虽然承认 DITA 可以有效地替代复杂行业中的大型用户手册，但同时也哀叹“这种结构化内容的形式会让人感到冷漠和没有人情味”（瓦赫特·伯特歇尔，2012年，第

source: While authors certainly can work on a topic-based environment without DITA (see Baker, 2013), the term topic is frequently associated with this open standard, as explained in the following quote from Andersen & Batova:
zh_cn: 虽然作者当然可以在不使用 DITA 的情况下创建基于话题的内容（参见贝克，2013年），但是术语“话题”（topic）经常与DITA这个开放标准联系在一起，正如安德森和巴特瓦所说：

source: While earlier cookbooks may have had separate recipes for strawberry milkshakes, raspberry milkshakes and boysenberry milkshakes, eventually, he imagines, someone said, “Why don't we collapse that into one milkshake recipe?”
zh_cn: 虽然早期的食谱中可能会为草莓奶昔、覆盆子奶昔和波森莓奶昔分别提供食谱，但加西亚猜想，最终有人会说，“为什么不把它们合成一个奶昔食谱呢?”

source: While terms such as granules, modules, and units are commonly used to describe these blocks, the term topic has gained the most traction in the past few years, particularly in the trade literature.
zh_cn: 当“颗粒”、“模块”、“单位”等术语都普遍被用来描述构建块，“主题”（topic）这个术语在过去的几年里获得了最大关注度，特别是在贸易文档领域。

source: While this requirement initially surprises some authors, it provides benefits for both authors and LwDITA stylesheet developers, and is an important foundational feature of LwDITA
zh_cn: 虽然这个需求最初让一些作者感到惊讶，但它为作者和LwDITA样式表开发人员都提供了好处，而且是LwDITA的一个重要的基本特性

source: William Hart-Davidson was an early DITA adopter in academia.
zh_cn: 威廉·哈特·戴维森是学界最早采用DITA的人之一

source: Win/win.
zh_cn: 这是双赢。

source: Wing (2008) describes computing as a combination of “mental” tools (abstractions) and “metal” tools (automation).
zh_cn: 温 (2008) 将计算机描述为“思考”工具（抽象）和“物理”工具（自动化）的结合。

source: With a minimum of information, the user can independently explore a product after learning some basic concepts and tasks.
zh_cn: 实现信息极简化的情形下，用户在学习了一些基本概念和任务后，可以独立探索产品。

source: With its title element, the sample XDITA topic now cleared Oxygen error messages.
zh_cn: 添加了标题元素后， 示例中 XDITA 话题清除了 Oxygen 验证错误提示。

source: With the advent of XML as a new markup standard in 1998, the Customer and Service Information (C&SI) group began adopting a Tools and Technology mantra under Dave Schell who was the strategy lead.
zh_cn: 随着1998年 XML 作为一种新的标记标准的出现，客户和服务信息组（C&SI）在战略领导人戴夫·席尔（Dave Schell）的带领下，开始采用一种工具和技术准则。

source: With the completed plan sheets, you will be able to determine systematically and with reasonable completeness the information you need to write the parts of the manual” (1984, p.14).
zh_cn: 计划表就绪后，你就能做出体系化决策，并且能够获得全面的写作手册各部分所需的信息。(1984, p.14).

source: With this new title component, the topic stub now can clear validation warnings in a LwDITA-aware tool like Oxygen XML Editor, and it can be seen in author mode, which hides the XML code and allows editing in an environment similar to a WYSIWYG editor (Figure 6.7).
zh_cn: 有了这个全新的标题组件，Oxygen XML Editor 等支持 LwDITA 的工具中的验证错误提示就可以清除了。作者模式也可以清楚地显示话题结构，该模式会隐藏 XML 代码，允许创作者在类似 WYSIWYG 编辑器的环境中进行编辑（图6.7）。

source: Without a LwDITA-aware editor, you probably would need to use the open source DITA Open Toolkit, as Chef Pedro did in Chapter 1, to process LwDITA content and produce end-user deliverables.
zh_cn: 如果没有支持LwDITA的编辑器，您可能需要像第一章佩德罗那样使用开源的的DITA Open Toolkit来处理LwDITA内容并生成最终用户交付的内容。

source: Without a doubt, the definition list is one of the most verbose XDITA environments.
zh_cn: 毫无疑问，定义列表是最繁冗的 XDITA 内容环境之一，

source: Without a doubt, these features and benefits can also be intimidating for an author new to DITA.
zh_cn: 毫无疑问，对于 DITA 新手来说，这些特性和优势也可能令人生畏。

source: Without it, the topic will not validate as standards-based XDITA content.
zh_cn: 没有它，话题将不能被识别为基于标准的 XDITA 格式的内容。

source: Without it, the topic would just be a regular XML file (like the first marinara sauce recipe from Chapter 1), and would need its own stylesheets and schemas to produce deliverables for end users.
zh_cn: 如果没有这行代码，该话题将只是一个普通 XML 文件（就像第一章中的第一个意式番茄罗勒酱菜谱示例那样），并且需要特定的样式表和模型来为终端用户生成可交付内容。

source: Without levels or layers of abstraction, a developer would have to code, for example, a Twitter status update directly into a series of instructions for the computer's processor and memory.
zh_cn: 举个例子，如果没有抽象层级或级别的概念的话，假设 Twitter 的状态码更新了，开发人员就必须将其直接编码为一系列指令，交给计算机处理器和内存执行。

source: Wording that is independent of any other topic
zh_cn: 独立于任何其他主题的措辞

source: Would that they taught it in college.
zh_cn: 希望大学里能教授这种技能，

source: Writer, who creates content
zh_cn: 创作者，编写内容

source: Writers have often created technical information that is too complete, including everything there is to know about a product.
zh_cn: 作者经常创建过于完整的技术信息，包括关于产品的所有需要了解的信息。

source: Writing reusable content is a rare skill.
zh_cn: 创作可重复使用的内容是一种罕见的技能。

source: Wygant's analysis of a user manual then focused on the criteria behind the extent and cost of documentation: content, intent, and technique.
zh_cn: 怀甘特对于用户手册分析集中于文档的范围和成本背后的标准:内容、意图和技术。

source: XDITA
zh_cn: XDITA 格式

source: XDITA and HDITA were confirmed.
zh_cn: 当时已经确定要加入 XDITA 和 HDITA 格式，

source: XDITA is similar to DITA XML by design.
zh_cn: XDITA在设计上类似于DITA XML。

source: XDITA opens structured authoring and automated publishing workflows to a greater number of organizations.
zh_cn: XDITA向更多的组织开源结构化创作和自动化发布工作流。

source: XDITA targets authors who are probably not DITA experts but could benefit from the structuring and publishing mechanism of a DITA-like workflow.
zh_cn: XDITA的目标用户可能不是DITA专家，但可以从类似于DITA工作流的结构和发布机制中获益的人群。

source: XDITA, an XML format with a subset of DITA elements that can be used for validated authoring and complex publishing chains
zh_cn: XDITA，一种包含 DITA 元素子集的 XML 格式，可验证写作，发布复杂内容链

source: XML, and as a consequence DITA, files can also be validated by XML Schema and RELAX NG (Regular Language for XML Next Generation) files.
zh_cn: XML 和 DITA 文件也可以通过 XML Schema 和 RELAX NG（下一代 XML 常规语言）文件校验。

source: Yes.
zh_cn: 是的，

source: Yet in many technical communication academic programs the preferred authoring tools and workflows involve a word processor or a static website platform.
zh_cn: 然而，在许多与技术传播相关的学术项目中，首选的创作工具和工作流程是文字处理软件或者静态网站平台。

source: Yet, John Carroll and I never worked together, as he left Virginia Tech a few months before I arrived as an assistant professor in 2004.
zh_cn: 然而我和约翰·卡罗尔并未共事过，因为2004年我作为助理教授加入弗吉尼亚理工大学时，他就已经离开数月了。

source: Yet, the big-picture ideas of topic-based information and component content management go beyond the actual topic types enforced by the DITA standard and DITA-aware tools.
zh_cn: 然而，基于话题的信息和组件内容管理的宏远想法，超出了 DITA 标准和支持 DITA 的工具所提供的话题类型。

source: Yet, this process is not
zh_cn: 然而，这一过程在技术传播领

source: You can apply the quality characteristics whether you're writing a book, a page, a paragraph, a sentence, or a single word in an interface.
zh_cn: 无论你是在写一本、一页、一段、一句话还是界面中的一个词，你都可以应用质量特征。

source: You can create LwDITA content in any text editor, but probably should avoid using a word processor or a desktop publishing solution (because those embed behind-the-scenes code for format and layout that an author cannot control).
zh_cn: 您可以在任何文本编辑器中创建LwDITA内容，但是可能应该避免使用文字处理程序或桌面发布解决方案(因为那些用于格式和布局的嵌入后台代码是作者无法控制的)。

source: You can create the XDITA map from Figure 5.8 in any text editor or in a LwDITA-aware tool like Oxygen XML Editor.
zh_cn: 你可以在任何文本编辑器或 Oxygen XML Editor 等支持 LwDITA 的工具中创建图5.8中的 XDITA 地图。

source: You can create this HDITA topic in any text editor, a more advanced HTML editor, or a LwDITA-aware tool like Oxygen XML.
zh_cn: 你可以使用任何文本编辑器、更高级的 HTML 编辑器或支持 LwDITA 的工具(如Oxygen XML)创建示例中的 HDITA 话题。

source: You can create this file in any text editor or a LwDITA-aware tool, and save it as franchise-intro.md.
zh_cn: 你可以在任何文本编辑器或支持 LwDITA 的工具中创建该文件，并将其保存为 franchise-intro.md。

source: You can download the DITA-OT from the website https:// www.dita-ot.org/download.
zh_cn: 你可以从 https:// www.dita-ot.org/download 上下载 DITA-OT。

source: You can live in an MDITA environment without XML or HTML tags and you would still be using LwDITA.
zh_cn: 你可以没有接触过 XML 或 HTML 的标签而选择使用 MDITA，使用 MDITA 也是在使用 LwDITA。

source: You can save the file from figure 5.13 as sensei-brochure.md and then use a LwDITA-aware tool to produce the PDF deliverable.
zh_cn: 你可以将图5.13展示的文件保存为 sensei-brochure.md ，然后使用支持 LwDITA 的工具生成 PDF 交付物。

source: You can specify an alternate folder in the transformation scenario dialog window.
zh_cn: 你也可以在转换选项对话框窗口中指定另一个文件夹。

source: You can type the code from Figure 6.1 in any text editor, but working in a LwDITA-aware application like Oxygen XML Editor brings benefits like autocompletion of tags and templates, which can reduce spelling errors and typos.
zh_cn: 你可以在任何文本编辑器中输入图6.1 中的代码，但是如果使用支持 LwDITA 的应用程序（如 Oxygen XML Editor）可以带来诸如益处，如自动填写标签和模板，这可以减少拼写和打字错误。

source: You can work in HDITA all the time and you would still be using LwDITA.
zh_cn: 你可以一直使用 HDITA，使用 HDITA 也就是在使用 LwDITA。

source: You do not need to use all three “flavors” at the same time to adopt LwDITA.
zh_cn: 使用 LwDITA 时，你不需要同时选择三种“风格”。

source: and HDITA author perspective: As a college professor, I had access to a population of novice content creators who were familiar with HTML but did not know XML.
zh_cn: 在那之后，我决定联系普里斯特利并邀请他合作开展一个从作者视角研究 XDITA 和 HDITA 的项目：作为一名大学教授，我可以接触到一群熟悉 HTML，但不太了解 XML的内容创建新手。

source: communication) is all about more and more structured content and the ability to work faster and smarter with XML and DITA constructs.” Approaching the end of its 2:30-minutes runtime, the video claims that “it is most certainly an exciting future to be in” (AdobeTCS, 2012).
zh_cn: 传播的未来），意味着越来越结构化的内容，以及更快、更智能地使用 XML 和 DITA 结构的能力。”在这时长2小时30分钟的视频即将结束之时，视频旁白声宣称 “这无疑是一个令人兴奋的未来”（AdobeTCS， 2012年）。

source: content types for its initial release: topic and map.
zh_cn: 内容类型：话题（topic）和地图（map）。

source: describe the DITA map as “the glue that binds your topics together, the driver for producing your output, and the information path for your users to follow” (Bellamy et al., 2012, p.
zh_cn: 称 DITA 地图是“将话题绑定在一起的粘合剂，是生成输出物的驱动器，也是用户可以遵循的信息路径”(Bellamy et al., 2012, p.

source: example is an XML comment (enclosed within the characters <!-- and -->) that I am using as a temporary placeholder for actual content.
zh_cn: 是一行 XML 注释（包含在字符 <!-- 和 --> 之间），我把它作为实际内容的临时占位符。

source: hold actual content (e.g., <Name>), and others nest additional levels of elements and, eventually, content (e.g. the “parsley” <Item> inside <Ingredient> inside <IngredientList>).
zh_cn: 包含实际的内容（例如，<Name>），另一些子元素又包含其他级别的元素，并最终包含内容（例如，“parsley” 包含于 <Item> ，<Item> 包含于 <Ingredient> ，<Ingredient>包含于 <IngredientList>）。

source: in Intelligent Content: A Primer, which introduces important keywords that drive the development of those “more than templates” of structured authoring that allow writers to put into action thought structures built
zh_cn: 该定义包含了非常重要的关键词，这些关键词驱动了结构化写作超级模板的开发， 使作者能够将由坚实的抽象概念搭建的结构交付生产，

source: intelligent content should present the following five characteristics:
zh_cn: 智能内容应该具有以下五个特征:

source: its support for LwDITA topics and maps.
zh_cn: 其对 LwDITA 话题和地图映射的支持。

source: kitchen team requires a web version of the recipe, the DITA-OT also provides that option and allows the author to link to a Cascading Style Sheet (CSS) file for formatting and design (Figure 1.5).
zh_cn: 需要一份网页形式的菜谱，DITA-OT 也提供了这个选项，并允许作者为网页的格式和设计嵌入层叠样式表（Cascading Style Sheet, CSS）文件（图1.5）。

source: looks like a wrench tool with a play button) on the main toolbar while a map is open in the editor window.
zh_cn: 看起来像一个扳手，扳手下方有一个播放按钮），同时在编辑器窗口中打开一个地图。

source: map are the base document types in the architecture” (Eberlein et al., 2015, p.
zh_cn: 映射是架构中的基本文本类型(Eberlein et al., 2015, p.

source: new in the world of technical communication: it has been more than 17 years since Hart-Davidson (2001) asked scholars and practitioners to see the content chunks of single-sourcing projects as rhetorical objects and not just mere information.
zh_cn: 域并不新鲜：自哈特-戴维森 (Hart-Davidson, 2001) 要求学者和从业者将同源开发项目中的内容块视为修辞对象而不仅仅是信息以来，已经超过十七年了。

source: on solid abstractions that could lead to automated publishing workflows.
zh_cn: 实现自动化的发布工作流。

source: practices to work relevant to their identity as content creators.
zh_cn: 作为内容创作者时在工作中应用计算机实践。

source: recommend using DITA maps to create an information set that specify which topics should be included in a user deliverable produced from the map, define an information architecture with the navigation for a set of topics, and create relationships between topics (Bellamy et al., 2012).
zh_cn: 建议使用 DITA 地图创建一个信息集合，DITA 地图指定了哪些话题应该被包括在用户输出的可交付成果中，使用话题导航定义了信息体系结构，并创建了话题之间的关系（贝拉米等，2012年）。

source: references.
zh_cn: 层级和关系。

source: series of abstractions, each abstraction building on the one below it” (2006, pp.
zh_cn: 一系列的抽象层级，每个抽象层级建立在下一层级之上” (2006, pp.

source: silos.
zh_cn: 多种工具。

source: that emphasizes “that topic and
zh_cn: 强调“主题和

source: the field at the intersection of information technology and organizational communication (Dayton, 2004).
zh_cn: 另一个阵营站在信息科技和组织传播的十字路口 (Dayton, 2004)。

source: the importance of a generic topic, defined as “the basic unit of authoring and reuse” (2.2.1.1 The topic as the basic unit of information, 2016), which is the only information type included in the base edition of the DITA standard.
zh_cn: 通用话题是“创作和复用的基本单元”（2.2.1.1 话题是信息的基础单元，2016年），也是 DITA 标准基本版中包含的唯一信息类型。

source: the layers of abstraction that I will introduce in Chapter 8.
zh_cn: 八章中介绍的抽象层级奠定了坚实的基础。

source: the map to a web deliverable.
zh_cn: 一个网页交付物。

source: the topic's body (<body>), and some paragraphs (<p>).
zh_cn: 主题的正文 (<body>), 以及段落(<p>).

source: version of LwDITA, now renamed MDITA, to the official DITA Technical Committee.
zh_cn: 提交到官方的 DITA 技术委员会。

source: visited the Virginia Tech campus to give a talk precisely on rhetorical topics and commonplaces, Hart-Davidson linked those traits or moves to elements from the DITA standard, which I tried to capture in Table 2.
zh_cn: 哈特-戴维森访问了维吉尼亚理工大学校园，就修辞主题和常规做了一次演讲，他把这些特征或文步与DITA标准中的元素联系起来，我试图在表2中捕捉到这些元素。

source: wrote the following on the 3rd edition of DQTI:
zh_cn: 第三版DQTI还有如下内容：

source: { Attract and motivate your readers with graphic techniques
zh_cn: { 用图形技术来吸引和刺激读者

source: { Cover all the topics that readers need, and only those topics
zh_cn: { 包含且仅包含读者需要所有主题

source: { Cover each topic in just as much detail as readers need
zh_cn: { 尽可能详细地介绍每一个主题

source: { Define each term new to the intended reader
zh_cn: { 为目标读者定义每个新术语

source: { Devise titles and headings to reveal the task
zh_cn: { 设计标题以揭示任务内容

source: { Don't force readers to branch unnecessarily
zh_cn: { 不要强迫读者做无畏的新探索

source: { Emphasize main points; subordinate secondary points
zh_cn: { 强调重点，下移次重点

source: { Employ visual techniques to communicate effectively
zh_cn: { 运用视觉技术进行有效沟通

source: { Highlight key terms - including new terms being defined
zh_cn: { 强调关键术语 - 包括新定义的术语

source: { In introductory sections, reveal the order of topics to follow
zh_cn: { 简介部分介绍主题次序

source: { Include all standard parts and all promised information
zh_cn: { 包含所有的标准部分和承诺提供的信息

source: { Indicate a practical reason for information
zh_cn: { 说明信息的应用性

source: { Order the presentation to reflect the order of use
zh_cn: { 按使用顺序排列演示

source: { Pace the presentation to be neither too fast nor too slow
zh_cn: { 演示的速度不要太快也不要太慢

source: { Present information from the reader's point of view
zh_cn: { 从读者视角展示信息

source: { Present material so readers can understand it the first time
zh_cn: { 用读者一眼就能明了的方式演示材料

source: { Present similar topics in a similar way
zh_cn: { 类似主题采用类似呈现方式

source: { Provide accurate references and other auxiliary information
zh_cn: { 提供准确的参考资料和其他辅助信息

source: { Provide accurate technical information
zh_cn: { 提供准确的技术信息

source: { Provide appropriate examples to communicate effectively
zh_cn: { 提供适当的例子以便有效沟通

source: { Rarely run a paragraph beyond a dozen lines
zh_cn: { 尽量不要出现一段十几行的情况

source: { Rarely run text for half a page without a heading
zh_cn: { 尽量不要出现半页纸都没有标题的情况

source: { Repeat information only when readers will benefit from it (Dean et al., 1983).
zh_cn: { 只有当读者能从中受益时，才重复信息(Dean et al., 1983).

source: { Reveal how the pieces fit together
zh_cn: { 展现各部分如何相互配合

source: { Stock the index with predictable entries for the topics covered
zh_cn: { 在索引中为涉及的主题添加可能需要的入口

source: { Use correct grammar, spelling, and punctuation
zh_cn: { 使用正确的语法、拼写和标点符号

source: { Use only technical terms that are necessary and appropriate
zh_cn: { 只使用必要和适当的技术术语

source: { Use sexually neutral terms, unless other terms are appropriate
zh_cn: { 使用中性的术语，除非有其他合适的术语

source: { Write directly and economically
zh_cn: { 直接而经济地写

source: {{ Analysis of lightweight DITA implementation options in other formats, including HTML5 and markdown
zh_cn: 对基于其他格式的轻量级 DITA 的执行选项的分析，包括 HTML5 和 Markdown

source: {{ Analysis of lightweight DITA related personas, scenarios, and requirements {{ Lightweight authoring profiles for topic, concept, task, reference, potentially others
zh_cn: 对与轻量级 DITA 相关的人物画像、场景和需求的分析 为话题（topic）、概念（concept）、任务（task）、引用（reference）以及可能出现的其他内容撰写轻量级简介

source: {{ Implementations of lightweight DITA that allow for roundtripping with constrained versions of other formats (Priestley, 2014a).
zh_cn: 轻量级 DITA 可以与其他格式的受限版本兼容（普里斯特利，2014年)

source: {{ Lightweight specialization architecture
zh_cn: 轻量级的专门化体系结构

source: {{ Lightweight topic: basic topic with default content models (sections, conditional attributes, list nesting enabled)
zh_cn: 轻量级话题：具有默认内容模型（支持节、条件属性、嵌套列表）的基本话题

source: {{ Specialization authoring format
zh_cn: 专门化的编写格式

source: {{ Specialization topic: topic specifically designed for defining lightweight specializations
zh_cn: 专门化话题：为定义轻量级的专门化而特意设计的话题

source: {{ Superlightweight topic: lightweight topic with constraints applied (no list nesting, no attributes, no sections)
zh_cn: 超轻量级话题：应用了约束规则的轻量级话题（没有列表嵌套、属性和节）

source: “A lot of things changed,” Carroll said.
zh_cn: 卡罗尔说，“很多事都变了，”

source: “A page of ‘How to .
zh_cn: “一页有关‘如何做’的内容

source: “An appendix is the purest, most usable form of computer system documentation.
zh_cn: “附录是最纯粹、最有用的计算机系统文件形式。

source: “DITA: An XML-Based Technical Documentation Authoring and Publishing Architecture” was authored by Michael Priestley, Gretchen Hargis, and Susan Carpenter, who have appeared previously as key players in this chapter.
zh_cn: 迈克尔·普里斯特利、格雷琴·哈吉斯和苏珊·卡朋特共同撰写了“DITA:基于XML的技术文档编写和发布架构”，这三位是本章的核心人物。

source: “Friendly manuals sell products, expand users' understanding of the extra features, and save everyone's time,” he wrote (Price, 1984, p.7).
zh_cn: “友好的手册能增加产品销量、扩展用户对附加功能的理解，并节省每个人的时间。” 他写到(Price, 1984, p.7).

source: “If you learn to make a computer repeat steps, does that influence how you think about your co-workers, as Jeannette Wing suggests?
zh_cn: “如果你学会了让电脑重复一些步骤，那这会不会如珍妮特·温所说影响你对同事的看法？

source: “In this layer, students write content once, and then create multiple deliverables for different audiences, using some unique topics and some reused topics” (Evia et al., 2015, pp.
zh_cn: “在这一层级中，学生只需编写一次内容，就可以使用自己编写的独特话题和可复用话题，为不同的受众创建多种可交付成果” (Evia et al., 2015, pp.

source: “John Carroll's work on minimalism was part of the context of DITA,” Priestley told me.
zh_cn: “约翰·卡罗尔在极简主义上的工作，培育了DITA发展的土壤。”普里斯特利告诉我说。

source: “List each error message that a user may encounter.
zh_cn: “列出用户可能遇到的所有错误信息。

source: “One thing is that back in the day, people had to be tinkerers because things didn't work and they were clunky and you had to know your Unix and not be scared of the command line blinking.
zh_cn: “其一就是在过去的年代，人们不得不开动脑筋，因为系统笨重且无法运行，你必须了解Unix操作系统并且不对一闪一闪的命令行产生畏惧心理。

source: “The main objective in this layer is to introduce technical documentation as a process and not just a product.”
zh_cn: “这一层级的主要目标是将技术文档开发视为一个过程，而非产品”。

source: “The overall objective of this layer is to make students comfortable with topic-based writing and the functions and responsibilities of a DITA author.”
zh_cn: “这一层级的总体目标是让学生适应基于话题的写作方式，了解 DITA 写作者的作用和职责。”

source: “There is a reason when you go to the ‘Joy of Cooking' and you want to make a strawberry milkshake, you don't look under ‘strawberry milkshake,'” he said.
zh_cn: 加西亚表示：“如果你想做草莓奶昔，然后翻看《烹饪的乐趣》一书查找食谱，你不会直接寻找“草莓奶昔”食谱。”

source: “This layer has the objective of introducing component-based XML authoring and filtering with the purpose of presenting modules created in XML as equivalents of more traditional technical and professional writing genres.”
zh_cn: “这一层级的目标是介绍基于组件的 XML 写作和过滤过程，将用 XML 创建的模块表示为更传统的技术和专业写作体裁的等价内容。”

source: “This layer requires (students) to relinquish control of format in order to create content within an XML and template-based environment.”
zh_cn: “这一层级要求（学生）放弃使用格式，以便在基于XML和模板的环境中创建内容”。

source: “This section does not apply to all software packages (sic), and its contents are variable even when it does apply.
zh_cn: “这个章节并不适用于所有软件包，并且在应用的软件上，其内容也千差万别。”

source: “When I open a box, and I take something out and there's no manual, that's my first thought: Where's the manual?” For a moment, he acknowledged that readers lost something when the manual became an extinct genre: “The instruction manual was also a symbol of empowerment, almost democratic; that's another source of the nostalgia.
zh_cn: “当我打开一个箱子并从中拿出一些东西，却发现里面没有手册，我的第一反应是：手册去哪了？”在这一瞬间，他承认当手册成为绝迹的体裁后，读者失去了一些东西：“说明书也是种授权的象征，可以说几乎是随心所欲；这也是引发怀旧之情的原因之一。”

source: • A community of developers investing in improvements to the DITA model • An open source toolkit you can use to produce your own output in multiple media without having to invest in proprietary tools
zh_cn: • 整个社区的开发者都致力于提升 DITA 模型；• DITA 是一个开源工具包，可以使用它生成多种媒体文件，而无需购买于特有工具

source: • A fully tested DTD or schema for XML-based authoring
zh_cn: DITA是一种经过充分检验的用于 XML 创作的 DTD 或模式

source: • A thoroughly developed approach to information development originating with OASIS and now encompassing many other companies, large and small, that find value in a standards-based approach (2011, p.
zh_cn: • DITA 是一种深入发展的信息开发方法，起源于 OASIS，使用于大大小小各种公司，这些公司发现了 DITA 的价值 （2011年，第

source: • Allay anxiety
zh_cn: • 减轻焦虑

source: • Anticipate variations
zh_cn: • 预估变化

source: • Basic topic components
zh_cn: · 基本话题类型

source: • Body elements: 29, including <ol>, <p>, and <ul>
zh_cn: • 正文元素：29, 包括 <ol>, <p>, 和 <ul>

source: • Chef Pedro's critique of the recipe (structured as a DITA concept)
zh_cn: • 厨师佩德罗对菜谱的评价（以 DITA 概念（concept）话题的结构编写）

source: • Chef Pedro's “about” page, with biographical and professional information (structured as a DITA concept).
zh_cn: • 介绍厨师佩德罗的“关于”页面，包含人生经历和专业信息（以 DITA 概念（concept）话题的结构编写）

source: • Concept elements: 2, consisting of <concept> and <conbody>
zh_cn: • 概念元素： 2, 包括 <concept> 和 <conbody>
